DataFrame 공부

In [1]:
import pandas as pd

In [2]:
stock_data = pd.read_csv('stock.adj_close.csv',index_col = 0)
stock_data

,2018-06-01,2018-06-04,2018-06-05,2018-06-07,2018-06-08,2018-06-11,2018-06-12,2018-06-14,2018-06-15,2018-06-18,...,2020-09-07,2020-09-08,2020-09-09,2020-09-10,2020-09-11,2020-09-14,2020-09-15,2020-09-16,2020-09-17,2020-09-18
Symbol,,,,,,,,,,,,,,,,,,,,,
A000020,11550.0,11750.0,11700.0,11650.0,11500.0,11500.0,11650.0,12000.0,11800.0,11450.0,...,25550.0,23650.0,24550.0,25950.0,26750.0,26300.0,25400.0,25050.0,25300.0,25050.0
A000030,15500.0,15950.0,16050.0,16500.0,16600.0,16650.0,16850.0,16500.0,16100.0,16350.0,...,14800.0,14800.0,14800.0,14800.0,14800.0,14800.0,14800.0,14800.0,14800.0,14800.0
A000040,2992.0,3021.0,3025.0,3069.0,3045.0,2984.0,2976.0,3033.0,3033.0,3017.0,...,980.0,932.0,741.0,875.0,840.0,860.0,833.0,817.0,812.0,796.0
A000050,13200.0,13550.0,13600.0,13800.0,13800.0,13800.0,13650.0,13850.0,14500.0,14550.0,...,11100.0,11350.0,11550.0,11500.0,11550.0,11300.0,11300.0,11050.0,10900.0,10750.0
A000060,20050.0,20050.0,20150.0,20050.0,20400.0,20150.0,20700.0,20950.0,20150.0,20900.0,...,12700.0,12700.0,12650.0,12700.0,12800.0,13000.0,13200.0,13150.0,13150.0,13200.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
A950160,38600.0,36400.0,36350.0,38700.0,40200.0,39250.0,38300.0,38350.0,39000.0,37600.0,...,9540.0,9540.0,9540.0,9540.0,9540.0,9540.0,9540.0,9540.0,8010.0,8010.0
A950170,13850.0,14250.0,14450.0,14300.0,14150.0,13650.0,14050.0,13600.0,13550.0,11900.0,...,4040.0,4050.0,4245.0,4275.0,4200.0,4195.0,4070.0,4045.0,4015.0,4055.0
A950180,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,13200.0,13150.0,13100.0,13150.0,13100.0,13900.0,13250.0,13350.0,13550.0,13450.0
A950190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,32200.0,31200.0,30400.0,30500.0,30150.0,30050.0,31450.0,31750.0,31200.0,30350.0
A950200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,16750.0,16950.0,17250.0,17100.0,17350.0,17450.0,15800.0,15100.0,14700.0,14550.0

In [3]:
my_df = stock_data.T.loc['2020-09-09':,'A005900':'A006000']
my_df

Symbol      A005930  A005940  A005950  A005960  A005980  A005990
2020-09-09  58400.0   9190.0   9080.0  11000.0    671.0   7990.0
2020-09-10  59200.0   9280.0   9280.0  11150.0    671.0   7960.0
2020-09-11  59000.0   9270.0   9360.0  11050.0    671.0   8120.0
2020-09-14  60400.0   9370.0   9400.0  11200.0    671.0   8200.0
2020-09-15  61000.0   9470.0   9390.0  11350.0    671.0   8180.0
2020-09-16  61000.0   9530.0   9080.0  11250.0    671.0   8180.0
2020-09-17  59500.0   9320.0   8880.0  11000.0    671.0   8000.0
2020-09-18  59300.0   9320.0   9070.0  10850.0    671.0   8020.0

In [4]:
my_df.loc['2020-09-15','A005930']

61000.0

In [5]:
my_df.loc['2020-09-15','A005930':'A005950']

Symbol
A005930    61000.0
A005940     9470.0
A005950     9390.0
Name: 2020-09-15, dtype: float64

In [6]:
my_df.loc['2020-09-15':'2020-09-18','A005930']

2020-09-15    61000.0
2020-09-16    61000.0
2020-09-17    59500.0
2020-09-18    59300.0
Name: A005930, dtype: float64

In [7]:
my_df.loc['2020-09-15':'2020-09-18':2,'A005930']

2020-09-15    61000.0
2020-09-17    59500.0
Name: A005930, dtype: float64

In [8]:
my_df.iloc[4:7]

Symbol      A005930  A005940  A005950  A005960  A005980  A005990
2020-09-15  61000.0   9470.0   9390.0  11350.0    671.0   8180.0
2020-09-16  61000.0   9530.0   9080.0  11250.0    671.0   8180.0
2020-09-17  59500.0   9320.0   8880.0  11000.0    671.0   8000.0

In [9]:
my_df.iloc[4:7:2]

Symbol      A005930  A005940  A005950  A005960  A005980  A005990
2020-09-15  61000.0   9470.0   9390.0  11350.0    671.0   8180.0
2020-09-17  59500.0   9320.0   8880.0  11000.0    671.0   8000.0

In [10]:
my_df.iloc[0, 3:]

Symbol
A005960    11000.0
A005980      671.0
A005990     7990.0
Name: 2020-09-09, dtype: float64

In [11]:
my_df.iloc[4:7:2, 1:4]

Symbol      A005940  A005950  A005960
2020-09-15   9470.0   9390.0  11350.0
2020-09-17   9320.0   8880.0  11000.0

In [12]:
my_df.loc[::,'A005930']

2020-09-09    58400.0
2020-09-10    59200.0
2020-09-11    59000.0
2020-09-14    60400.0
2020-09-15    61000.0
2020-09-16    61000.0
2020-09-17    59500.0
2020-09-18    59300.0
Name: A005930, dtype: float64

In [13]:
my_df.iloc[5:,::3].shape

(3, 2)

In [14]:
my_df.iloc[::4]

Symbol      A005930  A005940  A005950  A005960  A005980  A005990
2020-09-09  58400.0   9190.0   9080.0  11000.0    671.0   7990.0
2020-09-15  61000.0   9470.0   9390.0  11350.0    671.0   8180.0

In [15]:
my_df.iloc[::4].loc[:,'A005950':]

Symbol      A005950  A005960  A005980  A005990
2020-09-09   9080.0  11000.0    671.0   7990.0
2020-09-15   9390.0  11350.0    671.0   8180.0

In [16]:
my_df.loc['2020-09-09'::4].iloc[:,2:]

Symbol      A005950  A005960  A005980  A005990
2020-09-09   9080.0  11000.0    671.0   7990.0
2020-09-15   9390.0  11350.0    671.0   8180.0

In [17]:
my_df_2 = my_df.loc[:'2020-09-11','A005960':]
my_df_2

Symbol      A005960  A005980  A005990
2020-09-09  11000.0    671.0   7990.0
2020-09-10  11150.0    671.0   7960.0
2020-09-11  11050.0    671.0   8120.0

In [18]:
my_df_2 * 1.30

Symbol      A005960  A005980  A005990
2020-09-09  14300.0    872.3  10387.0
2020-09-10  14495.0    872.3  10348.0
2020-09-11  14365.0    872.3  10556.0

In [19]:
my_df_2.mean(axis = 0)

Symbol
A005960    11066.666667
A005980      671.000000
A005990     8023.333333
dtype: float64

In [20]:
my_df_2.mean(axis = 1)

2020-09-09    6553.666667
2020-09-10    6593.666667
2020-09-11    6613.666667
dtype: float64

 DataFrame 연산 정렬

In [21]:
my_df_2.notna()

Symbol      A005960  A005980  A005990
2020-09-09     True     True     True
2020-09-10     True     True     True
2020-09-11     True     True     True

In [22]:
my_df_2.sum(axis = 0)

Symbol
A005960    33200.0
A005980     2013.0
A005990    24070.0
dtype: float64

In [25]:
my_df_2.median(axis = 1)

2020-09-09    7990.0
2020-09-10    7960.0
2020-09-11    8120.0
dtype: float64

In [26]:
my_df_2.cumsum(axis = 0)

Symbol      A005960  A005980  A005990
2020-09-09  11000.0    671.0   7990.0
2020-09-10  22150.0   1342.0  15950.0
2020-09-11  33200.0   2013.0  24070.0

In [27]:
my_df_2.sort_values('A005990', axis = 0, ascending = True)

Symbol      A005960  A005980  A005990
2020-09-10  11150.0    671.0   7960.0
2020-09-09  11000.0    671.0   7990.0
2020-09-11  11050.0    671.0   8120.0

In [28]:
my_df_2.sort_values('A005990', axis = 0)

Symbol      A005960  A005980  A005990
2020-09-10  11150.0    671.0   7960.0
2020-09-09  11000.0    671.0   7990.0
2020-09-11  11050.0    671.0   8120.0

In [33]:
my_df_2.sort_values('2020-09-11', axis = 'columns', ascending = True)

Symbol      A005980  A005990  A005960
2020-09-09    671.0   7990.0  11000.0
2020-09-10    671.0   7960.0  11150.0
2020-09-11    671.0   8120.0  11050.0

In [34]:
my_df_2.rank(axis = 0, ascending = False)

Symbol      A005960  A005980  A005990
2020-09-09      3.0      2.0      2.0
2020-09-10      1.0      2.0      3.0
2020-09-11      2.0      2.0      1.0

In [36]:
pd.DataFrame([[0,1,2],[3,4,5]],
             index = ['00','11'],
             columns = ['a','b','c'] )

    a  b  c
00  0  1  2
11  3  4  5

In [37]:
import numpy as np
pd.DataFrame(np.ones((3,5)))

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0

In [40]:
traffic_data = pd.DataFrame(
    [[9800,5500],[10200,6600]],
    index = ['10/22','10/23'],
    columns = ['원티드','사람인'])
traffic_data

         원티드   사람인
10/22   9800  5500
10/23  10200  6600

In [42]:
traffic_data.loc[:,'잡플래닛'] = np.nan
traffic_data

         원티드   사람인  잡플래닛
10/22   9800  5500   NaN
10/23  10200  6600   NaN

In [44]:
traffic_data.loc[:,'잡코리아'] = [980, 1020]
traffic_data

         원티드   사람인  잡플래닛  잡코리아
10/22   9800  5500   NaN   980
10/23  10200  6600   NaN  1020

In [46]:
traffic_data.loc[:,'스펙업'] = 20000
traffic_data

         원티드   사람인  잡플래닛  잡코리아    스펙업
10/22   9800  5500   NaN   980  20000
10/23  10200  6600   NaN  1020  20000

In [47]:
traffic_data.loc['10/24'] = [12500,4520,3000, 780,21000]
traffic_data

         원티드   사람인    잡플래닛  잡코리아    스펙업
10/22   9800  5500     NaN   980  20000
10/23  10200  6600     NaN  1020  20000
10/24  12500  4520  3000.0   780  21000

In [48]:
traffic_data.loc['10/25'] = 2000
traffic_data

         원티드   사람인    잡플래닛  잡코리아    스펙업
10/22   9800  5500     NaN   980  20000
10/23  10200  6600     NaN  1020  20000
10/24  12500  4520  3000.0   780  21000
10/25   2000  2000  2000.0  2000   2000

In [49]:
traffic_data.loc['10/22','잡플래닛'] = 99
traffic_data

         원티드   사람인    잡플래닛  잡코리아    스펙업
10/22   9800  5500    99.0   980  20000
10/23  10200  6600     NaN  1020  20000
10/24  12500  4520  3000.0   780  21000
10/25   2000  2000  2000.0  2000   2000